{
  "recipes": [
    {
      "id": 2,
      "name": "Cucumber Salad",
      "image": "https://i.pinimg.com/564x/6d/4e/1f/6d4e1fed5eeee1b784ae3b5d1bed17a8.jpg",
      "ingredients": "1 small honeydew melon / rockmelon,1 cup sago (tapioca pearls), 1/2 cup sugar, 1/2 cup water",
      "instructions": "Dry cucumber with a paper towel and crush or cut into bite sized pieces and place into a bowl. Add the garlic. In another bowl, add vinegar, soy sauce, sugar, salt, and sesame oil and mix well. When ready to serve, pour sauce over cucumber and add chili oil as desired.",
      "type": "Chinese"
    },
    {
      "id": 3,
      "name": "Peanut Butter and Jelly",
      "image": "https://www.gannett-cdn.com/media/2021/05/02/USATODAY/usatsports/imageForEntry14-XDZ.jpg  ",
      "ingredients": "2 slices of bread",
      "instructions": "Spread peanut butter on one piece of bread. Spread jelly on other side of other piece of bread. Putting jelly and peanut butter together, put both pieces together. Serve with milk.",
      "type": "American"
    },
    {
      "id": 4,
      "name": "Thai Coconut Soup",
      "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2017%2F02%2F2319909.jpg&w=272&h=272&c=sc&poi=face&q=85",
      "ingredients": "1tbsp vegtable oil, 2tbsp grated ginger, 1 stalk minced lemon grass, 2tsp red curry paste, 4 cups chicken broth, 3 tablespoons fish sauce, 1tbsp light brown sugar, 3 cans coconut milk, 1/2lb sliced shitake mushrooms, 1lb medium shrimp, 2tbsp lime juice, 1/4cup fresh cilantro ",
      "instructions": "Heat the oil in a large pot over medium heat. Cook and stir the ginger, lemongrass, and curry paste in the heated oil for 1 minute. Slowly pour the chicken broth over the mixture, stirring continually. Stir in the fish sauce and brown sugar; simmer for 15 minutes. Stir in the coconut milk and mushrooms; cook and stir until the mushrooms are soft, about 5 minutes. Add the shrimp; cook until no longer translucent about 5 minutes. Stir in the lime juice; season with salt; garnish with cilantro.",
      "type": "Thai"
    },
    {
      "id": 5,
      "name": "Tomatillo Salsa Verde",
      "image": "https://www.simplyrecipes.com/thmb/Cd_5EzNSPzOkFiSWk1Bhi9nVE_Q=/1800x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2005__05__tomatillo-salsa-verde-horiz-a2-1800-72b444f130af43f78bd20afb2974818d.jpg",
      "ingredients": "1 1/2 pounds tomatillos, 1/2 cup chopped white onion, 2 cloves garlic (optional), 1/2 cup chopped cilantro, 1tbsp fresh lime juice, 2 jalapeño or serrano peppers, salt to taste",
      "instructions": "Cut the tomatillos in half and place cut side down on a foil-lined baking sheet. Add a few garlic cloves in their skin (if using) Place under a broiler for about 5-7 minutes to lightly blacken the skins of the tomatillos. Place the cooked tomatillos, lime juice, onions, garlic (if using), cilantro, chili peppers in a blender or food processor and pulse until all ingredients are finely chopped and mixed. Season to taste with salt.",
      "type": "Mexican"
    },
    {
      "id": 6,
      "name": "Corn Dogs",
      "image": "https://natashaskitchen.com/wp-content/uploads/2020/10/Corn-Dogs-11.jpg",
      "ingredients": "12 hot dogs, 12 sticks, peanut oil for frying, 1 1/2 cups fine yellow corn meal, 1 1/4 cups all-purpose flour 1/4 cup granulated sugar,1 Tbsp baking powder, 1/4 tsp salt, 1 3/4 cups buttermilk, 1 large egg, 1 Tbsp olive oil or vegetable oil, 1 Tbsp honey",
      "instructions": "Pour 2-3” of oil in a large pot or dutch oven and heat to 350˚F over medium heat. Pat dry with paper towels. Insert sticks into hot dogs. Whisk together dry ingredients (corn meal, flour, sugar, baking powder and salt). Whisk together wet ingredients (buttermilk, egg, 1 Tbsp oil and honey). Combine wet and dry ingredients and whisk to combine. Pour batter into a drinking glass almost to the top and dip hot dogs. Put corndog straight down into batter and give it a little twirl to fully coat the hot dogs then swirl as you lift up. Let excess drip off. Hold corn dog at an angle in the hot oil for 5-7 seconds to let it seal then drop into oil (this keeps them from sticking to the bottom of the pot).  Fry 3 minutes or until golden brown. Fry up to 2-3 at a time (so you don’t drop the temperature), turning them as needed to brown evenly. Transfer to a wire rack to cool.",
      "servings": 4,
      "type": "American"
    },
    {
      "id": 7,
      "name": "Coconut Milk, Melon with Sago Dessert",
      "image": "http://www.fussfreecooking.com/wp-content/uploads/2010/12/a31.jpg",
      "ingredients": "1 small honeydew melon / rockmelon,1 cup sago (tapioca pearls), 1/2 cup sugar, 1/2 cup water, 1 cup canned coconut milk  with 1/2 tsp salt",
      "instructions": "Boil sugar and water in a pot until the sugar is completely dissolved and becomes syrupy. Set aside to cool. In a separate pot, boil at least 7 cups of water. When the water is boiling, add sago and cook on medium-high heat until mostly translucent ( sago will dissolve and becomes gooey when overcooked – hence the visible white dots). Also, keep stirring to avoid the sago from sticking to the pot. When the sago is cooked, drain it over a sieve and rinse it under cold running water. Set aside. Use a melon baler, scoop the flesh out. Alternatively, you can dice the melon instead. Keep half the melon portion for later (for serving) and blend the remaining portion using a food processor. Mix the syrup, sago, melon and coconut milk in a large serving bowl. Chill before serving (note – as the mixture chills, the consistency will thicken a little).",
      "servings": 4,
      "type": "Chinese"
    }
  ]
}